# 숫자
print(273)  # print vs console.log vs System.out.print()
print(53.273)

# 타입 확인, type(자료)
print(type(52)) # int
print(type(52.273)) # float

# 지수 표현 : 지수 승 표현 방법, 자료 e지수승
0.52273e2   # 0.52273 * 10^2
0.52273e-2  # 0.52273 / 10^2

# 연산자
print("5 + 7 = :",5+7)
print("5 - 7 = :",5-7)
print("5 * 7 = :",5*7)
print("5 / 7 = :",5/7)
print("5 // 7= :",5//7) # 정수형으로 표현
print("5 % 7= :",5%7)
print("2**1= :",2**1)
print("2**2= :",2**2)
print("2**3= :",2**3)
print("2**4= :",2**4)   # ** 제곱

# 문제 1
print("안녕"+"하세요"*3)
print(("안녕"+"하세요")*3)
print("안녕"+("하세요"*3))
print(("안녕"+"하세요")*3)

# 확인 문제 1
# int
# float

# 확인 문제 2
# +,-,*,/,//,%,**

# 확인 문제 3
print(" # 기본적인 연산 ")
print(15, "+", 4, "=", 15+4)
print(15, "-", 4, "=", 15-4)
print(15, "*", 4, "=", 15*4)
print(15, "/", 4, "=", 15/4)

# 확인 문제 4
print(3462//17)
print(3462%17)

# 확인 문제 5
print(2+2-2*2/2*2)
print(2-2+2/2*2+2)